/*
2019年06月24日14:09:16
功能:求1到100的奇数和、1到100的偶数和、1到100的奇数个数、1到100的奇数平均值。
*/


#include <stdio.h>

int main(void)
{
	int count = 101, k = 0,m = 0,n = 0;
	double p;

	for (int i = 1; i < count; ++i)
	{
		if (i%2 == 1)
		{
			k += i;
			n++;
		}
		else
			m += i;
	}

	p = k/(float)(n);//也可以写成p = 1.0*k/n;

	printf("1到100的奇数和 = %d\n", k);
	printf("1到100的偶数和 = %d\n", m);
	printf("1到100的奇数个数 = %d\n", n);
	printf("1到100的奇数平均值 = %f\n", p);

	return 0;
}

/*
输出结果为:
----------------------------------------------
1到100的奇数和 = 2500
1到100的偶数和 = 2550
1到100的奇数个数 = 50
1到100的奇数平均值 = 50.000000
----------------------------------------------
总结：为了求平均值的时候，不要舍弃小数点后的数字，如果被除数和除数都是整数，商一定是整数。
eg 10/3=3
所以设计了数据类型转换。

*/