/*
2019年06月27日10:51:50
目的：测试传统数组能不能手动输入长度
*/
#include <stdio.h>
#include <stdlib.h>

void g(int * p)
{
	*p = 20;
	free(p);
}

int main(void)
{
    /*
        int * q = (int*) malloc(sizeof(int)*4);

        scanf("%d",&q[0]);

        printf("%d\n",q[0]); 没问题

    */ 
    
    int len;

    scanf("%d",&len);

    int a[len];

    //int a[len] = {1};报错

    a[0] = 1;

    a[2] = 3;

    printf("%d\n",*a);

    return 0;
}

/*
输入是
------------------------------------------
1
------------------------------------------
输出结果是
------------------------------------------
1
------------------------------------------

总结：在这个版本中，a[len]是可以运行的，但是a[len]只能初始化，不能直接赋值；

*/