/*
2019年06月28日08:52:49	
目的：测试else与哪个if成对
*/
#include <stdio.h>
#include <math.h>
int main(void)
{
	int x = -3;

	// if (x >= 0)
	// {
	// 	if (x > 0)
	// 	printf("%d\n",1);
	// }	
	// else
	// printf("%d\n",0);//else和第一个if成对

	if (x >= 0)
	if (x > 0)
	printf("%d\n",1);
	else
	printf("%d\n",0);//不加括号，else默认和最近的if成对。 
					 //而且ifelse算一个语句，第一个if不加括号也不会出错。


	return 0;
}

/*
输入是
------------------------------------------
1
------------------------------------------
输出结果是
------------------------------------------
1
------------------------------------------

总结：在这个版本中，a[len]是可以运行的，但是a[len]只能初始化，不能直接赋值；

*/