/*
2019年06月28日10:47:14
目的：测试补码
*/
#include <stdio.h>
#include <math.h>
int main(void)
{

	int i = 0x7fffffff;	//int  能存的最大正整数 等价于 int i = pow(2,31)-1;
	//此时int占四个字节
 	
 	int j = 0x80000000;//int  能存的绝对值最大的负整数 等价于 int j = -pow(2,32);
	printf("%d\n", i);
	printf("%d\n", j);
 
	return 0;
}

/*

------------------------------------------
输出结果是
------------------------------------------
2147483647
-2147483648
------------------------------------------

总结：关于负数10进制整数转2进制补码存储，先取反再加1，最后高位补1.
	 关于2进制补码转负数10进制输出，先取反再加1，最后加负号；也可以先减一再取反，最后加负号。

*/